#include <Windows.h>
#include <stdio.h>  
#include <stdlib.h>
#include <time.h>

int main() {

	srand(time(0));
	//¼ÅÇÃ ==> ¹è¿­¾ÈÀÇ °ªµéÀ» ·£´ýÀ¸·Î ¼¯´Â°Í
	// ¹æ¹ý ==> 1) ·£´ýÀÎµ¦½º 1~ 4¸¦  »Ì´Â´Ù.
	// 2) ·£´ýÀÎµ¦½ºÀÇ °ª°ú 0¹øÀÎµ¦½º °ª°ú ±³È¯ 
	// 3) À§ ½ÄÀ» 100¹ø¹Ýº¹ 
	// int arr[5] = {10, 20, 30, 40, 50};
	// ¿¹ ) ·£´ýÀÎµ¦½º --> 3 ==>  {40, 20, 30, 10, 50};
	// ¿¹ ) ·£´ýÀÎµ¦½º --> 1 ==>  {20, 40, 30, 10, 50};
	// ¿¹ ) ·£´ýÀÎµ¦½º --> 4 ==>  {50, 40, 30, 10, 20};

	int a[5] = { 10, 20, 30, 40, 50 };
	int b = 0;

	while (b < 100) {
		int c = rand() % 4 + 1; // 1~4
		int temp = a[0];
		a[0] = a[c];
		a[c] = temp;
		b += 1;
	}

	b = 0;
	while (b < 5) {
		printf("%d ", a[b]);
		b += 1;
	}
	printf("\n");
}