#include <stdio.h>

int main() {
//문제1)
	int c = 0; //반복

	int arr[5] = { 10,20,30,40,50 };
	int a[5] = { 0,0,0,0,0 };
	int b[5] = { 0,0,0,0,0 };
	int d = 0;
	int i = 0;
	
		//문제1) arr의 값중에서 4의 배수만 a에 거꾸로저장
		// 예) a ={0,0,0,40,20}

	while (d < 5) {
		if (arr[i] % 4 == 0) {
			a[4 - i] = arr[i];
		}
		d += 1;
	}
	

	c = 4;
	while (c > -1) {
		printf("[%d] ", a[c]);
		c -= 1;
	}

	/*
	c = 0;
	while (c < 5) {
		printf("[%d] ", a[c]);
		c += 1;
	}
	*/

//문제2)

	int game[8] = { 0,2,2,0,0,8,0,4 };
	// 1)left 2)right 
	// 1번이나 2번을 선택하면 각방향으로 0 이아닌숫자들을 차례대로 모은다.
	//예) left ==> {2,2,8,4,0,0,0,0};
	//예) right ==> {0,0,0,0,2,2,8,4};



}