#include <stdio.h>
int main() {
	int e = 0; //반복

	// 문제 1) 아래 배열 a 에서 내가 입력한 값만 빼고 b 에 저장 
	int a[5] = { 10,20,30,40,50 };
	int b[5] = { 0,0,0,0,0 };
	// 예) 30 ==> b[5] = {10,20,40,50,0};
	int f = 0; int g = 0;




	// 문제 2) 아래 배열에서 내가 입력한 번호 만 빼고 d 에 저장 
	int c[6] = { 1001, 40, 1002, 65, 1003,  70 };
	int d[6] = { 0,0,0,0,0,0 };
	// 예) 1002 ==> d[6] = {1001, 40, 1003, 70 , 0, 0};
	int h = 0; int i = 0; int j = 0;

	printf("값을 입력하세요");
	scanf_s("%d", &h);

	while (i < 6) {
		if () {
			j += 1;
		}
		i += 1;
	}

	j = 0;
	while (j < 6) {
		printf("[%d] ", d[j]);
		j += 1;
	} 
	



}